# DelayedConstraintForHandle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..DelayedConstraintForHandle Property
BuiltInFailures..::..RebarFailures Class See Also
---
The selected constraint targets do not satisfy a valid constraint. The rebar preview corresponds to latest valid rebar constraints.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DelayedConstraintForHandle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DelayedConstraintForHandle As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DelayedConstraintForHandle {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace